test/src/test/testtool/EsbSoapValidator/12f/in.xml

<SOAPENV:Envelope xmlns:SOAPENV="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAPENV:Header>
		<MessageHeader>
			<From>
				<Id>portal</Id>
			</From>
			<To>
				<Location>TIBCO Service</Location>
			</To>
			<HeaderFields>
				<CPAId>cpid</CPAId>
				<ConversationId>ConversationId</ConversationId>
				<MessageId>MessageId</MessageId>
				<ExternalRefToMessageId>ExternalRefToMessageId</ExternalRefToMessageId>
				<Timestamp>2010-10-20T12:19:35</Timestamp>
			</HeaderFields>
			<Service>
				<Name>Document</Name>
				<Context>SalesDocument</Context>
				<Action>
					<Paradigm>Request</Paradigm>
					<Name>GetDocuments</Name>
					<Version>1</Version>
				</Action>
			</Service>
		</MessageHeader>
	</SOAPENV:Header>
	<SOAPENV:Body>
		<SetPolicyDetails_Request xmlns="http://nn.nl/XSD/PropertyCasualtyRetail/Log/LogConversion/1/SetPolicyDetails/1">
			<PolicyDetail>
				<FORECAST>a</FORECAST>
				<RVS_PARTY_ID>a</RVS_PARTY_ID>
				<COMPANY_CODE>a</COMPANY_CODE>
				<RVS_PAYLOAD>a</RVS_PAYLOAD>
				<NN_NOTIFY_PAYLOAD>a</NN_NOTIFY_PAYLOAD>
				<NN_COMPRODOC_PAYLOAD>String</NN_COMPRODOC_PAYLOAD>
				<NN_POLICY_NUMBER>String</NN_POLICY_NUMBER>
				<NN_POLICY_START_DATE>1967-08-13</NN_POLICY_START_DATE>
				<NN_PARTY_ID>String</NN_PARTY_ID>
				<STATUS>String</STATUS>
				<ERROR_REASON>String</ERROR_REASON>
				<BRE_PAYLOAD>String</BRE_PAYLOAD>
				<NN_PREMIUM>1234567891.12</NN_PREMIUM>
				<RVS_POLICY>
					<RVS_POLICY_NUMBER>a</RVS_POLICY_NUMBER>
					<RVS_POLICY_SEQNUM>a</RVS_POLICY_SEQNUM>
					<RVS_POLICY_VERSION>a</RVS_POLICY_VERSION>
					<RVS_BRANCH_CODE>a</RVS_BRANCH_CODE>
					<RVS_POLICY_TYPE>a</RVS_POLICY_TYPE>
					<RVS_PREMIUM>1234567891.12</RVS_PREMIUM>
					<STATUS>String</STATUS>
					<ERROR_REASON>String</ERROR_REASON>
				</RVS_POLICY>
				<RVS_POLICY>
					<RVS_POLICY_NUMBER>a</RVS_POLICY_NUMBER>
					<RVS_POLICY_SEQNUM>a</RVS_POLICY_SEQNUM>
					<RVS_POLICY_VERSION>a</RVS_POLICY_VERSION>
					<RVS_BRANCH_CODE>a</RVS_BRANCH_CODE>
					<RVS_POLICY_TYPE>a</RVS_POLICY_TYPE>
					<RVS_PREMIUM>1234567891.12</RVS_PREMIUM>
					<STATUS>String</STATUS>
					<ERROR_REASON>String</ERROR_REASON>
				</RVS_POLICY>
				<RVS_POLICY>
					<RVS_POLICY_NUMBER>a</RVS_POLICY_NUMBER>
					<RVS_POLICY_SEQNUM>a</RVS_POLICY_SEQNUM>
					<RVS_POLICY_VERSION>a</RVS_POLICY_VERSION>
					<RVS_BRANCH_CODE>a</RVS_BRANCH_CODE>
					<RVS_POLICY_TYPE>a</RVS_POLICY_TYPE>
					<RVS_PREMIUM>1234567891.12</RVS_PREMIUM>
					<STATUS>String</STATUS>
					<ERROR_REASON>String</ERROR_REASON>
				</RVS_POLICY>
			</PolicyDetail>
			<PolicyDetail>
				<FORECAST>a</FORECAST>
				<RVS_PARTY_ID>a</RVS_PARTY_ID>
				<COMPANY_CODE>a</COMPANY_CODE>
				<RVS_PAYLOAD>a</RVS_PAYLOAD>
				<NN_NOTIFY_PAYLOAD>a</NN_NOTIFY_PAYLOAD>
				<NN_COMPRODOC_PAYLOAD>String</NN_COMPRODOC_PAYLOAD>
				<NN_POLICY_NUMBER>String</NN_POLICY_NUMBER>
				<NN_POLICY_START_DATE>1967-08-13</NN_POLICY_START_DATE>
				<NN_PARTY_ID>String</NN_PARTY_ID>
				<STATUS>String</STATUS>
				<ERROR_REASON>String</ERROR_REASON>
				<BRE_PAYLOAD>String</BRE_PAYLOAD>
				<NN_PREMIUM>1234567891.12</NN_PREMIUM>
				<RVS_POLICY>
					<RVS_POLICY_NUMBER>a</RVS_POLICY_NUMBER>
					<RVS_POLICY_SEQNUM>a</RVS_POLICY_SEQNUM>
					<RVS_POLICY_VERSION>a</RVS_POLICY_VERSION>
					<RVS_BRANCH_CODE>a</RVS_BRANCH_CODE>
					<RVS_POLICY_TYPE>a</RVS_POLICY_TYPE>
					<RVS_PREMIUM>1234567891.12</RVS_PREMIUM>
					<STATUS>String</STATUS>
					<ERROR_REASON>String</ERROR_REASON>
				</RVS_POLICY>
				<RVS_POLICY>
					<RVS_POLICY_NUMBER>a</RVS_POLICY_NUMBER>
					<RVS_POLICY_SEQNUM>a</RVS_POLICY_SEQNUM>
					<RVS_POLICY_VERSION>a</RVS_POLICY_VERSION>
					<RVS_BRANCH_CODE>a</RVS_BRANCH_CODE>
					<RVS_POLICY_TYPE>a</RVS_POLICY_TYPE>
					<RVS_PREMIUM>1234567891.12</RVS_PREMIUM>
					<STATUS>String</STATUS>
					<ERROR_REASON>String</ERROR_REASON>
				</RVS_POLICY>
				<RVS_POLICY>
					<RVS_POLICY_NUMBER>a</RVS_POLICY_NUMBER>
					<RVS_POLICY_SEQNUM>a</RVS_POLICY_SEQNUM>
					<RVS_POLICY_VERSION>a</RVS_POLICY_VERSION>
					<RVS_BRANCH_CODE>a</RVS_BRANCH_CODE>
					<RVS_POLICY_TYPE>a</RVS_POLICY_TYPE>
					<RVS_PREMIUM>1234567891.12</RVS_PREMIUM>
					<STATUS>String</STATUS>
					<ERROR_REASON>String</ERROR_REASON>
				</RVS_POLICY>
			</PolicyDetail>
			<PolicyDetail>
				<FORECAST>a</FORECAST>
				<RVS_PARTY_ID>a</RVS_PARTY_ID>
				<COMPANY_CODE>a</COMPANY_CODE>
				<RVS_PAYLOAD>a</RVS_PAYLOAD>
				<NN_NOTIFY_PAYLOAD>a</NN_NOTIFY_PAYLOAD>
				<NN_COMPRODOC_PAYLOAD>String</NN_COMPRODOC_PAYLOAD>
				<NN_POLICY_NUMBER>String</NN_POLICY_NUMBER>
				<NN_POLICY_START_DATE>1967-08-13</NN_POLICY_START_DATE>
				<NN_PARTY_ID>String</NN_PARTY_ID>
				<STATUS>String</STATUS>
				<ERROR_REASON>String</ERROR_REASON>
				<BRE_PAYLOAD>String</BRE_PAYLOAD>
				<NN_PREMIUM>1234567891.12</NN_PREMIUM>
				<RVS_POLICY>
					<RVS_POLICY_NUMBER>a</RVS_POLICY_NUMBER>
					<RVS_POLICY_SEQNUM>a</RVS_POLICY_SEQNUM>
					<RVS_POLICY_VERSION>a</RVS_POLICY_VERSION>
					<RVS_BRANCH_CODE>a</RVS_BRANCH_CODE>
					<RVS_POLICY_TYPE>a</RVS_POLICY_TYPE>
					<RVS_PREMIUM>1234567891.12</RVS_PREMIUM>
					<STATUS>String</STATUS>
					<ERROR_REASON>String</ERROR_REASON>
				</RVS_POLICY>
				<RVS_POLICY>
					<RVS_POLICY_NUMBER>a</RVS_POLICY_NUMBER>
					<RVS_POLICY_SEQNUM>a</RVS_POLICY_SEQNUM>
					<RVS_POLICY_VERSION>a</RVS_POLICY_VERSION>
					<RVS_BRANCH_CODE>a</RVS_BRANCH_CODE>
					<RVS_POLICY_TYPE>a</RVS_POLICY_TYPE>
					<RVS_PREMIUM>1234567891.12</RVS_PREMIUM>
					<STATUS>String</STATUS>
					<ERROR_REASON>String</ERROR_REASON>
				</RVS_POLICY>
				<RVS_POLICY>
					<RVS_POLICY_NUMBER>a</RVS_POLICY_NUMBER>
					<RVS_POLICY_SEQNUM>a</RVS_POLICY_SEQNUM>
					<RVS_POLICY_VERSION>a</RVS_POLICY_VERSION>
					<RVS_BRANCH_CODE>a</RVS_BRANCH_CODE>
					<RVS_POLICY_TYPE>a</RVS_POLICY_TYPE>
					<RVS_PREMIUM>1234567891.12</RVS_PREMIUM>
					<STATUS>String</STATUS>
					<ERROR_REASON>String</ERROR_REASON>
				</RVS_POLICY>
			</PolicyDetail>
		</SetPolicyDetails_Request>
	</SOAPENV:Body>
</SOAPENV:Envelope>